; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v1 - type_3 ?v6 - type_1)
 	      (pred_1 ?v4 - object ?v6 - type_1)
	      (pred_3 ?v1 - type_3 ?v2 - type_2)
	      (pred_2 ?v1 - type_3 ?v4 - object ?v2 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v8 ?v5 - type_1)
       :precondition (and  (pred_4 ?v1 ?v8))
       :effect (and  (pred_4 ?v1 ?v5)
		     (not (pred_4 ?v1 ?v8))))

   (:action op_1
       :parameters (?v1 - type_3 ?v7 - object ?v3 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v3) (pred_4 ?v1 ?v3) (pred_3 ?v1 ?v2))
       :effect (and (pred_2 ?v1 ?v7 ?v2)
		    (not (pred_1 ?v7 ?v3)) 
		    (not (pred_3 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_3 ?v7 - object ?v3 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v7 ?v2) (pred_4 ?v1 ?v3))
       :effect (and (pred_1 ?v7 ?v3)
		    (pred_3 ?v1 ?v2)
		    (not (pred_2 ?v1 ?v7 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_10 - type_3
obj_07 obj_12 obj_09 obj_05 - type_2
obj_04 obj_01 obj_03 obj_13 - type_1
obj_06 obj_11 obj_14 obj_08 - object)
(:init
(pred_4 obj_02 obj_03)
(pred_3 obj_02 obj_07)
(pred_3 obj_02 obj_12)
(pred_4 obj_10 obj_04)
(pred_3 obj_10 obj_09)
(pred_3 obj_10 obj_05)
(pred_1 obj_06 obj_04)
(pred_1 obj_11 obj_03)
(pred_1 obj_14 obj_03)
(pred_1 obj_08 obj_04)
)
(:goal
(and
(pred_1 obj_06 obj_03)
(pred_1 obj_11 obj_01)
(pred_1 obj_14 obj_04)
(pred_1 obj_08 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_02 obj_01) (pred_4 obj_10 obj_01))))
    (always (not (and (pred_4 obj_02 obj_03) (pred_4 obj_10 obj_03))))
  )
)
)

; plan
1. (op_1 obj_10 obj_08 obj_04 obj_05)
   deleted: (pred_1 obj_08 obj_04) (pred_3 obj_10 obj_05)
   added: (pred_2 obj_10 obj_08 obj_05)
   goals met: 0 of 4
2. (op_1 obj_10 obj_06 obj_04 obj_09)
   deleted: (pred_1 obj_06 obj_04) (pred_3 obj_10 obj_09)
   added: (pred_2 obj_10 obj_06 obj_09)
   goals met: 0 of 4
3. (op_1 obj_02 obj_14 obj_03 obj_12)
   deleted: (pred_1 obj_14 obj_03) (pred_3 obj_02 obj_12)
   added: (pred_2 obj_02 obj_14 obj_12)
   goals met: 0 of 4
4. (op_1 obj_02 obj_11 obj_03 obj_07)
   deleted: (pred_1 obj_11 obj_03) (pred_3 obj_02 obj_07)
   added: (pred_2 obj_02 obj_11 obj_07)
   goals met: 0 of 4
5. (op_3 obj_10 obj_04 obj_01)
   deleted: (pred_4 obj_10 obj_04)
   added: (pred_4 obj_10 obj_01)
   goals met: 0 of 4
6. (op_3 obj_02 obj_03 obj_04)
   deleted: (pred_4 obj_02 obj_03)
   added: (pred_4 obj_02 obj_04)
   goals met: 0 of 4
7. (op_2 obj_10 obj_08 obj_01 obj_05)
   deleted: (pred_2 obj_10 obj_08 obj_05)
   added: (pred_1 obj_08 obj_01) (pred_3 obj_10 obj_05)
   goals met: 1 of 4
8. (op_2 obj_02 obj_14 obj_04 obj_12)
   deleted: (pred_2 obj_02 obj_14 obj_12)
   added: (pred_1 obj_14 obj_04) (pred_3 obj_02 obj_12)
   goals met: 2 of 4
9. (op_3 obj_10 obj_01 obj_03)
   deleted: (pred_4 obj_10 obj_01)
   added: (pred_4 obj_10 obj_03)
   goals met: 2 of 4
10. (op_3 obj_02 obj_04 obj_01)
   deleted: (pred_4 obj_02 obj_04)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 4
11. (op_2 obj_10 obj_06 obj_03 obj_09)
   deleted: (pred_2 obj_10 obj_06 obj_09)
   added: (pred_1 obj_06 obj_03) (pred_3 obj_10 obj_09)
   goals met: 3 of 4
12. (op_2 obj_02 obj_11 obj_01 obj_07)
   deleted: (pred_2 obj_02 obj_11 obj_07)
   added: (pred_1 obj_11 obj_01) (pred_3 obj_02 obj_07)
   goals met: 4 of 4
